[{
		"name": "GAME DESCRIPTION",
		"description": "What about getting a new virtual friend? This time, it is going to be Talking Juan, a cat that will turn your life into a cool adventure. Unlike in a similar series about talking friends, you will have to take your new friend to an open world and explore it with him. You will also have to take care of Juan – give him some food. Be careful as the menu contains some poisonous ingredients. In case the cat is not well, you can always give him some paracetamol and continue your cool adventures. Have fun!",
		"img": "https://dl.memuplay.com/new_market/img/com.dwerxs.TalkingJuan.TalkingTom.icon.2023-01-12-21-41-23.png"
	
	}, {
		"name": "Play Talking Juan Game",
		"description": "The new chapter of a real hit – My Talking Tom – is at your disposal. The new features and cool adventures with the cutest cat ever are about to start. The main character, Tom, is even funnier and more interesting than he was! Now he reacts at all of your interactions differently and each day with Tom is full of surprises. You can make him your pet – feed him, wash him in the bathroom, and kiss him good night when he is tired after playing the whole day long. With time, your friend will become an adult cat – beautiful and smart! What is more, the game includes small additional entertainments!",
		"img": "https://dl.memuplay.com/new_market/img/com.dwerxs.TalkingJuan.TalkingTom.icon.2023-01-12-21-41-23.png"
	
  }, {
		"name": "Play Talking Juan Game",
		"description": "No way, your friends are in a big trouble! Some nasty raccoons, your biggest enemies, have done them harm and locked them all alone in a trap! Now they cannot go out and continue doing their superhero and cat stuff. This is something you cannot allow, because you are Tom, the bravest kitten in the world and the one, who values justice. So step on the road and start your rescuing mission. Get ready that the raccoons will try to stop you, because this is what they always do – preventing heroes from doing their noble job. However, you are strong, smart and fast enough to get through that! Where is your superhero suit? The time has come to put it on and start running fast! By the way, your successful mission completions will bring you even more adorable and cool outfits, so do your bets and unlock them all! Your friends cannot wait for you to meet them again.",
		"img": "https://dl.memuplay.com/new_market/img/com.dwerxs.TalkingJuan.TalkingTom.icon.2023-01-12-21-41-23.png"
    
    }, {
		"name": "Play Talking Juan Game",
		"description": "If you have a cat, you’ve probably imagined how it would be if your fluffy friend learned human speech. My Talking Tom will make this dream come true! Meet your new buddy, a charming and very intelligent cat named Tom. He doesn’t mind being cuddled, loves playing and is always up to anything you want to do. But, most importantly, he can talk and will entertain you with his funny voice throughout the gameplay! Plenty of adventures in the company of Tom and his sociable friends are waiting for you online!",
		"img": "https://dl.memuplay.com/new_market/img/com.dwerxs.TalkingJuan.TalkingTom.icon.2023-01-12-21-41-23.png"
	
	
  }, {
		"name": "Play Talking Juan Game",
		"description": "Chatty cats? Does this happen? It turns out that yes, and this application with the cat Talking Tom already has millions of fans around the world. And yet, he also has a girlfriend who, like him, does not mind talking. Therefore, do not deny yourself the pleasure and raise these kittens. Moreover, the matured Tom will bring you more and more joy every day by repeating any words. So, a great mood from the game is 100% guaranteed to you. So, have fun to the fullest!",
		"img": "https://dl.memuplay.com/new_market/img/com.dwerxs.TalkingJuan.TalkingTom.icon.2023-01-12-21-41-23.png"
	
  }, {
		"name": "Play Talking Juan Game",
		"description": "The most famous cat in the world, Tom, is here! He is willing to introduce his best friends to you and… his beloved lady, of course. This means that now you have an entire furry squad, so nice and adorable. The cats as well as their houses are extremely interactive and you are welcome to play with them any way you want. The houses are all customizable – do your best to design them in the coolest way. The cats like talking and having fun. Enjoy this furry company – we bet that they will become your best friends!",
		"img": "https://dl.memuplay.com/new_market/img/com.dwerxs.TalkingJuan.TalkingTom.icon.2023-01-12-21-41-23.png"
	
  }, {
		"name": "Play Talking Juan Game",
		"description": "Wanna spend a great time in the company of your new virtual friends? Then welcome to Talking Tom 2023! You’ll surely enjoy staying in this hospitable town inhabited by cats and dogs that live quite human lives. Tom has a house and even goes to work. And while, like all cats, he enjoys playing with a paper ball and having a plateful of hot milk, he is also fascinated with cycling, picnicking, playing tennis and all kinds of other things his feline kin don’t usually do. You’ll have a lot of fun together!",
		"img": "https://dl.memuplay.com/new_market/img/com.dwerxs.TalkingJuan.TalkingTom.icon.2023-01-12-21-41-23.png"
	
  }, {
		"name": "Play Talking Juan Game",
		"description": " Talking Tom and his friends have become quite good at running after all the mishaps with the house robbery. In this new game, you won’t have to chase the treacherous raccoon running away with your money. Instead, your task will be to reach the magic gates and run through them as fast as possible. Every second counts, so pick the shortest path possible and dodge the obstacles aptly – you don’t want anything to hold you up. Start playing as Tom and unlock Angela, Ginger and other characters in the process!",
		"img": "https://dl.memuplay.com/new_market/img/com.dwerxs.TalkingJuan.TalkingTom.icon.2023-01-12-21-41-23.png"
	
  }, {
		"name": "Play Talking Juan Game",
		"description": "We all love Tom, the talking cat, for his nice character and no shortage of words. But sometimes bad things happen to him and that’s where we need to lend him a helping hand. Just this night, Tom’s house was robbed. A wily raccoon took all of his savings and is now running off. You need to help Tom chase him all over the city and return his money. Race through different locations overcoming obstacles and collecting coins pouring out from the raccoon’s bag. The more of them you manage to pick up by the end of the level, the more cash you’ll have to unlock new heroes and buy cute things for Tom’s house!",
		"img": "https://dl.memuplay.com/new_market/img/com.dwerxs.TalkingJuan.TalkingTom.icon.2023-01-12-21-41-23.png"
	
	}, {
		"name": "Play Talking Juan Game",
		"description": "How many friends you do have now? With this free game you can have six friends, and this is definitely better than one. You will see a home for new characters, which you can customize on your own, adding or removing the details of interior design. In this home you have six different animals, and they need all your attention and care. Each of them is unique, so if you prefer someone, don’t forget about the rest! Can you cope with six pets at once? Then start the game and discover all peculiarities!",
		"img": "https://dl.memuplay.com/new_market/img/com.dwerxs.TalkingJuan.TalkingTom.icon.2023-01-12-21-41-23.png"
	
  }, {
		"name": "Play Talking Juan Game",
		"description": "....",
		"img": "https://dl.memuplay.com/new_market/img/com.dwerxs.TalkingJuan.TalkingTom.icon.2023-01-12-21-41-23.png"
	}
]
